guests = ['Hanna', 'Artem', 'Algis', 'Zhekas', 'Vladoss']

print(f"Эй! У нас новый стол и теперь мы можем вместить больше людей! Есть еще место, приходите!")
guests.insert(0, 'Albert')
guests.insert(2, 'Geralt')
guests.append('Jack')

print(f'Приветствую, {guests[0]}! Ты придешь ко мне на обед?')
print(f'Приветствую, {guests[1]}! Ты придешь ко мне на обед?')
print(f'Приветствую, {guests[2]}! Ты придешь ко мне на обед?')
print(f'Приветствую, {guests[3]}! Ты придешь ко мне на обед?')
print(f'Приветствую, {guests[4]}! Ты придешь ко мне на обед?')
print(f'Приветствую, {guests[5]}! Ты придешь ко мне на обед?')
print(f'Приветствую, {guests[6]}! Ты придешь ко мне на обед?')
print(f'Приветствую, {guests[7]}! Ты придешь ко мне на обед?')